## 🏗️ Terraform Plan - `dev` Environment

### Workflow Status
| Step | Status |
|------|--------|
| 🖌️ Format | ✅ |
| ⚙️ Init | ✅ |
| ✅ Validate | ✅ |
| 📖 Plan | ✅ |
| 🔒 Security Scan | ✅ |

### Resource Changes
| Action | Count |
|--------|-------|
| 🟢 Create | 5 |
| 🟡 Update | 1 |
| 🔴 Delete | 0 |

<details>
<summary>📋 Show Full Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.keyvault.azurerm_key_vault.main will be created
  + resource "azurerm_key_vault" "main" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = true
      + enabled_for_deployment          = false
      + enabled_for_disk_encryption     = true
      + enabled_for_template_deployment = false
      + id                              = (known after apply)
      + location                        = "eastus"
      + name                            = "banking-dev-kv-ht5m59"
      + public_network_access_enabled   = false
      + purge_protection_enabled        = true
      + resource_group_name             = "banking-dev-rg"
      + sku_name                        = "standard"
      + soft_delete_retention_days      = 30
      + tags                            = {
          + "CostCenter"  = "development"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
      + tenant_id                       = "52021890-a859-400c-a8e2-62d0c85d5e66"
      + vault_uri                       = (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Deny"
        }
    }

  # module.keyvault.azurerm_monitor_diagnostic_setting.keyvault[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "keyvault" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/f437c82a-c093-4ba0-b505-1bcf13d07af8/resourceGroups/banking-dev-rg/providers/Microsoft.OperationalInsights/workspaces/banking-dev-law"
      + name                           = "banking-dev-kv-ht5m59-diagnostics"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "AuditEvent"
        }
      + enabled_log {
          + category = "AzurePolicyEvaluationDetails"
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.keyvault.azurerm_private_endpoint.keyvault[0] will be created
  + resource "azurerm_private_endpoint" "keyvault" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "eastus"
      + name                     = "banking-dev-kv-ht5m59-pe"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "banking-dev-rg"
      + subnet_id                = "/subscriptions/f437c82a-c093-4ba0-b505-1bcf13d07af8/resourceGroups/banking-dev-rg/providers/Microsoft.Network/virtualNetworks/banking-dev-vnet/subnets/banking-dev-pe-subnet"
      + tags                     = {
          + "CostCenter"  = "development"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "default"
          + private_dns_zone_ids = [
              + "/subscriptions/f437c82a-c093-4ba0-b505-1bcf13d07af8/resourceGroups/banking-dev-rg/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "banking-dev-kv-ht5m59-psc"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "vault",
            ]
        }
    }

  # module.keyvault.azurerm_role_assignment.terraform_admin[0] will be created
  + resource "azurerm_role_assignment" "terraform_admin" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "31ad1e6d-5433-42a4-a4a2-ff2438ada1a4"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.keyvault.null_resource.cleanup_keyvault_diagnostics[0] will be created
  + resource "null_resource" "cleanup_keyvault_diagnostics" {
      + id       = (known after apply)
      + triggers = {
          + "diagnostic_name" = "banking-dev-kv-ht5m59-diagnostics"
          + "keyvault_id"     = (known after apply)
        }
    }

  # module.monitoring.azurerm_monitor_action_group.critical will be updated in-place
  ~ resource "azurerm_monitor_action_group" "critical" {
        id                  = "/subscriptions/f437c82a-c093-4ba0-b505-1bcf13d07af8/resourceGroups/banking-dev-rg/providers/Microsoft.Insights/actionGroups/banking-dev-critical-ag"
        name                = "banking-dev-critical-ag"
        tags                = {
            "CostCenter"  = "development"
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Owner"       = "devops@company.com"
            "Project"     = "banking"
        }
        # (4 unchanged attributes hidden)

      - webhook_receiver {
          - name                    = "slack-alerts" -> null
          - service_uri             = (sensitive value) -> null
          - use_common_alert_schema = true -> null
        }
    }

Plan: 5 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ keyvault_uri                           = "https://banking-dev-kv-ht5m59.vault.azure.net/" -> (known after apply)

```

</details>

---
*Triggered by @boateng0303 | Workflow: `Terraform Pull Request Validation` | [View Logs](https://github.com/boateng0303/aks-prod-grade-banking-infra/actions/runs/23418794177)*